{
  "tactics": [
    {"tactic_id": "TA0001", "tactic_name": "Initial Access", "description": "The initial access tactic represents techniques that adversaries use to gain an initial foothold within a network."},
    {"tactic_id": "TA0002", "tactic_name": "Execution", "description": "The execution tactic represents techniques that result in execution of adversary-controlled code on a local or remote system."},
    {"tactic_id": "TA0003", "tactic_name": "Persistence", "description": "The persistence tactic contains techniques that adversaries use to maintain access to systems across restarts, changed credentials, and other interruptions."},
    {"tactic_id": "TA0004", "tactic_name": "Privilege Escalation", "description": "The privilege escalation tactic contains techniques that adversaries use to gain higher-level permissions on a system or network."},
    {"tactic_id": "TA0005", "tactic_name": "Defense Evasion", "description": "The defense evasion tactic consists of techniques that adversaries use to avoid detection throughout their compromise."},
    {"tactic_id": "TA0006", "tactic_name": "Credential Access", "description": "The credential access tactic represents techniques used by adversaries to steal credentials like account names and passwords."},
    {"tactic_id": "TA0007", "tactic_name": "Discovery", "description": "The discovery tactic contains techniques that adversaries use to gain knowledge about the system and network."},
    {"tactic_id": "TA0008", "tactic_name": "Lateral Movement", "description": "The lateral movement tactic contains techniques that adversaries use to enter and control remote systems on a network."},
    {"tactic_id": "TA0009", "tactic_name": "Collection", "description": "The collection tactic contains techniques used to gather information and sources of information of interest to the adversary."},
    {"tactic_id": "TA0010", "tactic_name": "Exfiltration", "description": "The exfiltration tactic refers to techniques that adversaries may use to steal data from your network."},
    {"tactic_id": "TA0011", "tactic_name": "Command and Control", "description": "The command and control tactic represents how adversaries communicate with systems under their control within a victim network."},
    {"tactic_id": "TA0040", "tactic_name": "Impact", "description": "The impact tactic consists of techniques that adversaries use to disrupt availability or compromise integrity by manipulating business and operational processes."}
  ],
  "techniques": [
    {"technique_id": "T1566", "technique_name": "Phishing", "tactic_id": "TA0001", "description": "Adversaries may send phishing messages to gain access to victim systems."},
    {"technique_id": "T1566.001", "technique_name": "Spearphishing Attachment", "tactic_id": "TA0001", "description": "Adversaries may send spearphishing emails with a malicious attachment in an attempt to gain access to victim systems."},
    {"technique_id": "T1566.002", "technique_name": "Spearphishing Link", "tactic_id": "TA0001", "description": "Adversaries may send spearphishing emails with a link to a malicious website in an attempt to gain access to victim systems."},
    {"technique_id": "T1190", "technique_name": "Exploit Public-Facing Application", "tactic_id": "TA0001", "description": "Adversaries may attempt to exploit public-facing applications to gain initial access."},
    {"technique_id": "T1133", "technique_name": "External Remote Services", "tactic_id": "TA0001", "description": "Adversaries may leverage external remote services as a point of initial access."},
    {"technique_id": "T1078", "technique_name": "Valid Accounts", "tactic_id": "TA0001", "description": "Adversaries may obtain and abuse credentials of existing accounts as a means of gaining initial access."},
    {"technique_id": "T1110", "technique_name": "Brute Force", "tactic_id": "TA0006", "description": "Adversaries may use brute force techniques to gain access to accounts."},
    {"technique_id": "T1110.003", "technique_name": "Password Spraying", "tactic_id": "TA0006", "description": "Adversaries may use a password spraying technique for authentication brute force."},
    {"technique_id": "T1110.004", "technique_name": "Credential Stuffing", "tactic_id": "TA0006", "description": "Adversaries may use stolen credential lists to attempt to gain access to victim systems."},
    {"technique_id": "T1083", "technique_name": "File and Directory Discovery", "tactic_id": "TA0007", "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information."},
    {"technique_id": "T1046", "technique_name": "Network Service Scanning", "tactic_id": "TA0007", "description": "Adversaries may scan for services running on hosts to find opportunities for lateral movement or information gathering."},
    {"technique_id": "T1048", "technique_name": "Exfiltration Over Alternative Protocol", "tactic_id": "TA0010", "description": "Adversaries may exfiltrate data using a different protocol than that of the existing command and control channel."},
    {"technique_id": "T1567", "technique_name": "Exfiltration Over Web Service", "tactic_id": "TA0010", "description": "Adversaries may use an existing, legitimate web service to exfiltrate data."},
    {"technique_id": "T1567.002", "technique_name": "Exfiltration to Cloud Storage", "tactic_id": "TA0010", "description": "Adversaries may exfiltrate data to a cloud storage service."},
    {"technique_id": "T1059", "technique_name": "Command and Scripting Interpreter", "tactic_id": "TA0002", "description": "Adversaries may abuse command and script interpreters to execute commands, scripts, or binaries."},
    {"technique_id": "T1053", "technique_name": "Scheduled Task/Job", "tactic_id": "TA0003", "description": "Adversaries may use scheduled tasks to maintain persistence and execute programs at system startup or at specific times."},
    {"technique_id": "T1055", "technique_name": "Process Injection", "tactic_id": "TA0004", "description": "Adversaries may inject code into processes to evade process-based defenses and potentially elevate privileges."},
    {"technique_id": "T1027", "technique_name": "Obfuscated Files or Information", "tactic_id": "TA0005", "description": "Adversaries may use obfuscation to hide artifacts of an intrusion from analysis."},
    {"technique_id": "T1021", "technique_name": "Remote Services", "tactic_id": "TA0008", "description": "Adversaries may use remote services to move laterally within a network."},
    {"technique_id": "T1114", "technique_name": "Email Collection", "tactic_id": "TA0009", "description": "Adversaries may collect emails from victims to gather information."}
  ]
}
